In [1]:
import numpy as np
import pandas as pd

In [13]:
dictData = {"Izmir": [40, 35, 38], "Ankara": [30, np.nan, 28], "Istanbul": [np.nan, 30, 35]}
weatherDataFrame = pd.DataFrame(dictData)

In [14]:
weatherDataFrame

   Izmir  Ankara  Istanbul
0     40    30.0       NaN
1     35     NaN      30.0
2     38    28.0      35.0

In [15]:
newData = {"Izmir": [40, 35, 38], "Ankara": [30, np.nan, 28], "Istanbul": [np.nan, 30, 35], "Antalya": [45, np.nan, np.nan]}
newDataFrame = pd.DataFrame(newData)

In [16]:
newDataFrame

   Izmir  Ankara  Istanbul  Antalya
0     40    30.0       NaN     45.0
1     35     NaN      30.0      NaN
2     38    28.0      35.0      NaN

In [17]:
newDataFrame.dropna(axis=1, thresh=2)

   Izmir  Ankara  Istanbul
0     40    30.0       NaN
1     35     NaN      30.0
2     38    28.0      35.0

In [20]:
newDataFrame.fillna(35)

   Izmir  Ankara  Istanbul  Antalya
0     40    30.0      35.0     45.0
1     35    35.0      30.0     35.0
2     38    28.0      35.0     35.0

# Groupby

In [27]:
salaryDict = {"Departman": ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
                "Calisan Ismi": ["Ahmet", "Mehmet", "Atil", "Burak", "Zeynep", "Fatma"],
                "Maas": [100, 150, 200, 300, 400, 500]}

In [28]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [29]:
salaryDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [35]:
groupby1 = salaryDataFrame.groupby("Departman")

In [37]:
groupby1.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [39]:
groupby1.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [41]:
groupby1.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [50]:
dict1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
        "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
        "Kalori" : [100, 200, 300, 400]}

In [51]:
dataFrame1 = pd.DataFrame(dict1, index = [0, 1, 2, 3])

In [52]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [53]:
dict2 = {"Isim" : ["Batu", "Elif", "Osman", "Zeki"],
        "Spor" : ["Tenis", "Yüzme", "Badminton", "Basketbol"],
        "Kalori" : [100, 250, 300, 450]}

In [54]:
dataFrame2 = pd.DataFrame(dict2, index = [4, 5, 6, 7])

In [55]:
dataFrame2

    Isim       Spor  Kalori
4   Batu      Tenis     100
5   Elif      Yüzme     250
6  Osman  Badminton     300
7   Zeki  Basketbol     450

In [56]:
dict3 = {"Isim" : ["Fatma", "Murat", "Ezgi", "Ege"],
        "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
        "Kalori" : [150, 250, 350, 450]}

In [57]:
dataFrame3 = pd.DataFrame(dict3, index = [8, 9, 10, 11])

In [58]:
dataFrame3

     Isim       Spor  Kalori
8   Fatma       Koşu     150
9   Murat      Yüzme     250
10   Ezgi       Koşu     350
11    Ege  Basketbol     450

# Concatenation

In [59]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4     Batu      Tenis     100
5     Elif      Yüzme     250
6    Osman  Badminton     300
7     Zeki  Basketbol     450
8    Fatma       Koşu     150
9    Murat      Yüzme     250
10    Ezgi       Koşu     350
11     Ege  Basketbol     450

# Merge

In [60]:
mergeDict = {"Isim" : ["Ahmet", "Mehmet", "Atıl", "Burak"],
            "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"]}

In [61]:
mergeDataFrame1 = pd.DataFrame(mergeDict)

In [62]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2    Atıl       Koşu
3   Burak  Basketbol

In [63]:
mergeDict2 = {"Isim" : ["Ahmet", "Mehmet", "Atıl", "Burak"],         
            "Kalori" : [100, 150, 200, 250]}

In [64]:
mergeDataFrame2 = pd.DataFrame(mergeDict2)

In [65]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     150
2    Atıl     200
3   Burak     250

In [66]:
 pd.merge(mergeDataFrame1, mergeDataFrame2, on = "Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     150
2    Atıl       Koşu     200
3   Burak  Basketbol     250

In [67]:
maasSozlugu = {"Isim" : ["Ahmet", "Mehmet", "Atıl", "Burak"],
                "Departman" : ["Yazılım", "Satış", "Yazılım", "Pazarlama"],
                "Maas" : [100, 150, 200, 300]}

In [68]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [69]:
maasDataFrame

     Isim  Departman  Maas
0   Ahmet    Yazılım   100
1  Mehmet      Satış   150
2    Atıl    Yazılım   200
3   Burak  Pazarlama   300

In [70]:

maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [71]:
maasDataFrame["Departman"].nunique()

3

In [73]:
def bruttenNete(maas):
    return maas * 0.66

In [74]:
maasDataFrame["Maas"].apply(bruttenNete)

0     66.0
1     99.0
2    132.0
3    198.0
Name: Maas, dtype: float64

In [75]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [76]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
                "Karakter Ismi": ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
                "Karakter Yas": [9, 10, 50, 20, 10]}

In [77]:
karakterDataFrame = pd.DataFrame(yeniBirVeri)

In [78]:
karakterDataFrame

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [79]:
karakterDataFrame.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc = np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10